Revit 2024 API
BuiltInFailures.CurtainWallFailures.CannotDivideCurtainGrid Property
 Can't divide Curtain Grid by Grid Line.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId CannotDivideCurtainGrid { get; }
Visual Basic
Public Shared ReadOnly Property CannotDivideCurtainGrid As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ CannotDivideCurtainGrid {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.CurtainWallFailures Class
Autodesk.Revit.DB Namespace